# StructuralSectionPipestandardWallnominalthickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionPipestandardWallnominalthickness Property
ParameterTypeId Class See Also
---
"Wall Nominal Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionPipestandardWallnominalthickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionPipestandardWallnominalthickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionPipestandardWallnominalthickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace